Repository: ashiklom/AltYo
Catalog: po/*/LC_MESSAGES/altyo.po
Languages: ru

source: "command arg1 argN..."
ru: "комманда arg1 argN..."

source: 100 or lower is in percentage
ru: значение 100 или менее означает проценты

source: <b>Animation</b>
ru: <b>Анимация</b>

source: <b>Key bindings</b>
ru: <b>Комбинации клавиш</b>

source: <b>Pattern</b>
ru: <b>Редактировать шаблон заголовка терминала используя регулярные выражения</b>

source: <b>Size and position</b>
ru: <b>Размер и положение</b>

source: <b>Tab format</b>
ru: <b>Формат закладок</b>

source: <b>Tab: format</b> _INDEX_ - replace by tab index _TITLE_ - replace by terminal title. <b>Tab: pattern</b> _REPLACE_ - replace match pattern, but not subpatterns. _USER_ - use match subpattern as user name. _HOSTNAME_ - use match subpattern as host name. _PATH_ - use match subpattern as path.
ru: <b>Закладка: формат</b> _INDEX_ - заменить индексом закладки _TITLE_ - заменить заголовком терминала <b>Закладка: редактировать заголовок</b> _REPLACE_ - заменить совпадение,но не подсовпадения. _USER_ - использовать подсовпадение как имя пользователя. _HOSTNAME_ - использовать подсовпадение как имя хоста. _PATH_ - использовать подсовпадение как путь.

source: <b>Terminal</b>
ru: <b>Терминалъ</b>

source: <b>URL regexps</b>
ru: <b>URL регулярные выражения</b>

source: <b>Window</b>
ru: <b>Окно программы</b>

source: AYsettings
ru: Настройки

source: About
ru: О программе

source: Action
ru: Действия

source: Advanced
ru: Дополнительные

source: Allow remote control (CLI)
ru: Разрешить управление (CLI)

source: AltYo %s error
ru: AltYo ошибка %s

source: AltYo CSS style error
ru: AltYo ошибка CSS стиля

source: AltYo Settings
ru: Настройки

source: Alternate screen scroll
ru: Альтернативная прокрутка

source: Any changes
ru: Любых изменениях

source: Application style
ru: Стиль приложения

source: Arabic
ru: Арабский

source: Armenian
ru: Армянский

source: Auto
ru: Автоматически

source: Auto hide on focus lost
ru: Скрывать автоматически

source: Auto restart shell
ru: Автоматически перезапускать коммандную оболочку

source: Auto run commands
ru: Запускать команды при старте

source: Auto start with desktop session
ru: Запускать вместе с рабочим столом

source: Autohide
ru: Скрывать автоматически

source: Available only on debian based systems. Allow use mouse scroll in some programs,for example in less
ru: Доступно только в дистрибутивах основанных на Debian Позволяет использовать колёсико мышки для прокрутки в некоторых приложениях Например в less

source: Background color
ru: Цвет заднего фона

source: Background image file
ru: Фоновое изображение

source: Background opacity
ru: Прозрачность терминала

source: Background saturation
ru: Затенение заднего фона

source: Backspace key binding
ru: Клавиша Backspace генерирует

source: Baltic
ru: Балтийский

source: Base title
ru: Основной шаблон закладки

source: Block
ru: Блок

source: Celtic
ru: Кельтский

source: Center
ru: В центре

source: Central European
ru: Центральноевропейский

source: Check css
ru: Проверить css

source: Chinese Simplified
ru: Китайский упрощенный

source: Chinese Traditional
ru: Китайский традиционный

source: Close current tab
ru: Закрыть текущий терминал

source: Close dialog
ru: Закрыть диалог

source: Close search dialog
ru: Закрыть диалог поиска

source: Close tab
ru: Закрыть терминал

source: Close tab anyway?
ru: Закрыть терминал в любом случае?

source: Close tab by index
ru: Закрыть терминал по номеру

source: Color palette
ru: Палитра

source: Command
ru: Команда

source: Config is read only!
ru: Конфигурационный файл доступен только для чтения!

source: Confirm to Quit
ru: Запрашивать подтверждение перед выходом

source: Contents changed
ru: Изменениях в терминале

source: Controls whether or not the terminal will scroll the background image (if one is set) when the text in the window must be scrolled.
ru: Прокручивать задний фон вместе с текстом если для фонового изображения использется картинка из файла

source: Copy
ru: Копировать

source: Copy link
ru: Копировать ссылку

source: Copy selected text
ru: Копировать выделенный текст

source: Copy terminal host name
ru: Скопировать host name

source: Copy terminal name
ru: Скопировать заголовок терминала

source: Croatian
ru: хорватский

source: Cursor blink mode
ru: Режим мерцания курсора

source: Cursor shape
ru: Форма курсора

source: Custom shell
ru: Запускать эту оболочку

source: Custom title
ru: Особый заголовок

source: Cyrillic
ru: Кириллица

source: Cyrillic/Russian
ru: Кириллица/Русский

source: Cyrillic/Ukrainian
ru: Кириллица/Украинский

source: Debug
ru: Отладка

source: Default encoding
ru: Кодировка

source: Default monitor on which altyo will be shown at start up.
ru: Монитор по умолчанию, на котором будет запущена программа при старте.

source: Delete key binding
ru: Клавиша Delete генерирует

source: Delete sequence
ru: Экранирующая последовательность

source: Disable control of window dimension, and set --id=none
ru: Отключить управление размером окна, и установить --id=none

source: Disable key bindings
ru: Отключить горячие клавиши

source: Disable main hotkey
ru: Отключить главную горячую клавишу

source: Disable popup menu
ru: Отключить всплывающее меню

source: Disable sort tab
ru: Исключить из сортировки

source: Disable terminal menu
ru: Отключить меню терминала

source: Double hotkey milliseconds
ru: двойное нажатие мс.

source: Enable
ru: Вкл.

source: Exclude from saving session
ru: Исключить из сохранения сессии

source: Exclude variables
ru: Исключить переменные

source: Fake transparency
ru: Ненастоящая прозрачность

source: Far right
ru: В конце списка

source: Find next
ru: следующее

source: Find previous
ru: предыдущее

source: First monitor
ru: Первый монтор

source: Follow mouse cursor
ru: Следовать за мышью

source: Font
ru: Шрифт

source: Force debug
ru: Включить debug

source: Found important task "%s"
ru: Запущена важная программа "%s"

source: Fullscreen on maximize
ru: Во весь экран, при максимизации

source: Georgian
ru: Грузинский

source: Get/Set tab title
ru: Прочитать/Утановить заголовок терминала

source: Grab another key.
ru: Считать другую комбинацию клавиш

source: Greek
ru: Греческий

source: Gujarati
ru: Гуджарати

source: Gurmukhi
ru: Гурмукхи

source: Hebrew
ru: Иврит

source: Hebrew Visual
ru: Иврит (Визуальный)

source: Height
ru: Высота

source: Help
ru: Справка

source: Hidden
ru: Скрыть

source: Hide if one tab
ru: Скрывать если одна закладка

source: Hindi
ru: Хинди

source: Hostname
ru: Названию хоста

source: Ibeam
ru: I-образный

source: Icelandic
ru: Исландский

source: Japanese
ru: Японский

source: Key binding
ru: Горячие клавиши

source: Key bindings
ru: Горячие клавиши

source: Korean
ru: Корейский

source: Left
ru: Слева

source: Lock any configuration changes
ru: Заблокировать любые изменения конфигурации

source: Lock tab
ru: Защитить закладку

source: Look and feel
ru: Внешний вид и поведение

source: Looks good
ru: Выглядит хорошо

source: Match
ru: Регулярное выражение

source: Match case-sensitive
ru: Учитывать регистр

source: Match case-sensitive by default
ru: Учитывать регистр по умолчанию

source: Max tab width
ru: Максимальная ширина

source: Maximize - restore
ru: Развернуть на весь экран

source: Maximize window, or restore to normal size
ru: Развернуть окно на весь экран, или восстановить прежний размер

source: Never
ru: Никогда

source: New style will not be saved! in line %d at position %d error:%s
ru: Новый стиль не будет сохранён! в строке %d в позиции %d ошибка:%s

source: New tab
ru: Добавить терминал

source: New tab in current directory
ru: Открывать новый терминал в текущей директории

source: New tab position
ru: Положение новой закладки

source: New value of %s will not be saved! %s
ru: Новое значение %s не будет сохранено! %s

source: Next tab
ru: Следующий терминал

source: None
ru: Без сортировки

source: Nordic
ru: Скандинавский

source: Notify on
ru: Уведомлять об

source: Number of animation steps,less is faster.
ru: Количество щагов анимации, чем меньше тем быстрее

source: Off
ru: Не мерцает.

source: On
ru: Мерцает.

source: On close last tab
ru: После закрытия последней закладки

source: Open new tab
ru: Открыть новый терминал

source: Open new window
ru: Открыть новое окно

source: Pango Text Attribute Markup Language
ru: Синтаксис языка разметки Pango

source: Paste
ru: Вставить

source: Paste from primary clipboard
ru: Вставить из основного буфера обмена

source: Pattern
ru: Регулярное выражение

source: Persian
ru: Персидский

source: Please select key combination, to show/hide AltYo.
ru: Пожалуйста укажите комбинацию клавиш для скрития/показа программы АльтЁ

source: Press any key
ru: Нажмите любую кнопку

source: Press enter to appy
ru: Нажмите Enter чтобы применить

source: Prevent close
ru: Не закрывать если

source: Previous key '%s' incorrect or busy
ru: Предыдущая комбинация '%s' уже занята, или неправильнго формата

source: Previous tab
ru: Предыдущий терминал

source: Print debug information into stdout.
ru: Печатать отладочную информацию на стандартный вывод.

source: Pull down on the same screen where the mouse cursor. Useful on multimonitor systems.
ru: Окно будет выпадать на том же экране, где находится курсор мыши Используется если у вас несколько мониторов.

source: Quick settings
ru: Быстрые настройки

source: Quit
ru: Выход

source: Read configuration from file
ru: Прочитать конфигурацию из файла

source: Really quit?
ru: Действительно выйти?

source: Really reset to defaults? Current settings will be saved in backup file %s.bak
ru: Вы действительно хотите сбросить все настройки? Текущие настройки будут сохранены в %s.bak

source: Regular expression syntax
ru: Синтаксис регулярных выражений

source: Reload configuration
ru: Перечитать конфигурацию

source: Replace
ru: Заменить

source: Reset all settings to default values
ru: Сбросить настройки на значения по умолчанию

source: Restart shell
ru: перезапустить коммандную оболочку

source: Restart shell and hide
ru: перезапустить коммандную оболочку и скрыть окно

source: Restore all closed tabs
ru: Восстановить все закрытые вкладки

source: Restore closed tab
ru: Восстановить последнюю закрытую вкладку

source: Restore last closed tab
ru: Восстановить последнюю закрытую вкладку

source: Restore tabs
ru: Восстановить терминалы

source: Right
ru: Справа

source: Right next
ru: Справа от текущей

source: Romanian
ru: Румынский

source: Run
ru: Запустить

source: Run command as a login shell
ru: Запускать команду как оболочку входа

source: Run command in new tab
ru: Запустить команду в новой закладке

source: Run link Ctrl+left mouse button
ru: Открыть ссылку Ctrl+левая кнопка мыши

source: Run this command instead user shell
ru: Запускать эту команду вместо оболочки пользователя

source: Save session
ru: Сохранить сессию

source: Save session on quit
ru: Сохранять сессию при выходе

source: Scroll background
ru: Прокручивать задний фон

source: Scroll lines
ru: Обратная прокрутка

source: Scroll on keystroke
ru: Прокручивать при нажатии клавиши

source: Scroll on output
ru: Прокручивать при выводе

source: Search
ru: Поиск

source: Search in terminals titles
ru: Поиск в заголовках терминалов

source: Select tab by index
ru: Выбрать закладку по индексу

source: Select-by-word characters
ru: Выбирающие слово символы

source: Set application id, none means disable application id
ru: Установить id приложения, none означает не использовать id

source: Set/update default path
ru: Установить/Обновить путь по умолчанию

source: Settings
ru: Настройки

source: Settings...
ru: Настройки

source: Setup custom title?
ru: Утановить особый заголовок?

source: Shell terminated.
ru: Оболочка была закрыта

source: Show scrollbar
ru: Показывать прокрутку

source: Show/Hide
ru: Показать/скрыть окно AltYo

source: Show/Hide Quick list
ru: Показать/скрыть быстрые команды

source: Show/hide window
ru: Показать/скрыть окно

source: Sort by
ru: Сортировать по

source: Sort by hostname
ru: Выстроить по названию хоста

source: South European
ru: Южноевропейский

source: Speed
ru: Скорость

source: Start hidden
ru: Запускать свёрнутым

source: Start maximized
ru: При старте окно во весь экран

source: Stay on top
ru: Поверх всех окон

source: Stay on top by default
ru: Поверх всех окон

source: Stick
ru: Всегда на видимом рабочем месте

source: Switch to next tab
ru: Следующий терминал

source: Switch to previous tab
ru: Предыдущий терминал

source: Switch to tab %d
ru: Переключиться в терминал № %d

source: Switch to tab %d,double press switch to tab %d
ru: Переключиться на закладку %d,нажмите дважды для переключения на закладку %d

source: System
ru: Системный

source: Tab
ru: Закладка

source: Tab bar background
ru: Рисовать задний фон в закладках

source: Tab bar mode
ru: Режим закладок

source: Tab close delay
ru: Задержка закрытия вкладки

source: Tab is locked, are you sure you want to close?
ru: Вкладка защищена, вы действительно хотите закрыть?

source: Terminal allow bold text
ru: Разрешать полужирный текст

source: Terminal audible bell
ru: Подавать гудок

source: Terminal header
ru: Шаблон для заголовка терминала

source: Terminal menu
ru: Меню терминала

source: Terminal quick settings
ru: Быстрые настройки терминала

source: Terminal regexps
ru: Регулярные выражения терминала

source: Terminal visible bell
ru: "Визуальный" гудок

source: Text color
ru: Цвет текста

source: Thai
ru: Тайский

source: The time during which respond to the double pressing.
ru: Время, в течение которого реагировать на повторное нажатие.

source: Timeout before Notify
ru: Выждать перед уведомлением

source: Tint color
ru: Цвет затенения

source: Title changed
ru: Изменениях заголовка

source: Toggle AltYo in fullscreen mode
ru: Переключить полноэкранный режим

source: Toggle autohide
ru: Переключить состояние настройки автоматического скрытия

source: Toggle stick
ru: Переключить состояние настройки "всегда на видимом рабочем месте"

source: Turkish
ru: Турецкий

source: Underline
ru: Подчёркивание

source: Unicode
ru: Юникод

source: Update login records when command is launched
ru: Обновлять записи utmp/wtmp при запуске команды

source: Vietnamese
ru: Вьетнамский

source: Visible
ru: Показывать

source: Western
ru: Западноевропейский

source: When height equal 100, maximize window.
ru: Если значение равно 100 развернуть окно на весь экран

source: Width
ru: Ширина

source: Window gravity north
ru: Окно вверху

source: Workaround if focus lost
ru: Исправлять потерю фокуса

source: Wrap search
ru: Искать циклически

source: Wrap search by default
ru: Искать циклически по умолчанию

source: X Position
ru: Позиция по X

source: Y Position
ru: Позиция по Y

source: You are trying to use key binding "%s" for action "%s" but, same key binding already binded to the action "%s"
ru: Вы хотите использовать горячую клавишу "%s" для действя "%s" но, она уже занята другим действием "%s"

source: add
ru: Добавить

source: error
ru: Ошибка

source: if checked - gravity north, otherwise - gravity south
ru: если включено - окно вверху, если выключено - окно внизу

source: if error occurred, cursor will be placed at corresponding position
ru: Если будет найдена ошибка, курсор будет установлен в соответстующее ошибке положение

source: in line %d at position %d error:%s
ru: в строке %d в позиции %d ошибка:%s

source: index %d
ru: номер %d

source: label
ru: ярлык

source: lines count -1 means "infinite scrollback"
ru: количество линий -1 означает "бесконечная прокрутка"

source: maximize
ru: развернуть на весь экран

source: new custom title
ru: особый заголовок

source: remove
ru: Удалить

source: size in pixels -1 - max width is window width
ru: Размер в пикселях -1 - максимальная ширина равна ширине окна

source: tab_format wrong value! will be used default value. err:%s
ru: Неверное значение параметра tab_format, будет использованно значение по умолчанию! ошибка:%s

source: tab_title_format wrong value! will be used default value. err:%s
ru: Неверное значение параметра tab_title_format, будет использованно значение по умолчанию! ошибка:%s

source: tab_title_format_regex odd value of array length! will be used default value.
ru: Нечётное кличество в массиве tab_title_format_regex, будет использованно значение по умолчанию!

source: tab_title_format_regex wrong value! will be used default value. err:%s
ru: Неверное значение параметра tab_title_format_regex, будет использованно значение по умолчанию! ошибка:%s

source: terminal text
ru: в тексте терминала

source: terminal_exclude_variables wrong value! will be used default value. err:%s
ru: Неверное значение параметра terminal_session_exclude_regex, будет использованно значение по умолчанию! ошибка:%s

source: terminal_prevent_close_regex wrong value! will be used default value. err:%s
ru: Неверное значение параметра terminal_prevent_close_regex, будет использованно значение по умолчанию! ошибка:%s

source: terminal_session_exclude_regex wrong value! will be used default value. err:%s
ru: Неверное значение параметра terminal_session_exclude_regex, будет использованно значение по умолчанию! ошибка:%s

source: terminal_url_regexps odd value of array length! will be used default value.
ru: Нечётное кличество в массиве terminal_url_regexps, будет использованно значение по умолчанию!

source: terminal_url_regexps wrong value! will be used default value. err:%s
ru: Неверное значение параметра terminal_prevent_close_regex, будет использованно значение по умолчанию! ошибка:%s

source: terminals titles
ru: в заголовках терминалов

source: willemw12@gmail.com
ru: Константинов Денис
